run/staticDroplet/CSF/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default          Euler;
}

gradSchemes
{
    default          Gauss linear;
}

divSchemes
{
    div(phirb,alpha) Gauss linear;
    div(phi,thermo:rho.water) Gauss linear;
    div(phi,thermo:rho.air) Gauss linear;
    div(phi,p_rgh) Gauss linear;

    div(rhoPhi,U)  Gauss linear;
    div(rhoPhi,T)  Gauss linear;
    div(rhoPhi,K)  Gauss linear;
    div(phi,p)      Gauss linear;
    div(phi,k)      Gauss linear;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default          Gauss linear orthogonal;
}

interpolationSchemes
{
    default                 linear;
}

snGradSchemes
{
    default          orthogonal;
}

// ************************************************************************* //
