run/staticDroplet/CSF/system/setAlphaFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setAlphaFieldDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "./caseConditions"

field       "alpha.water";
type        sphere;
radius      #eval{0.5*$diameter};

originX     #eval{2.5*$diameter};
originY     #eval{2.5*$diameter};
originZ     #eval{2.5*$diameter};
origin      ($originX $originY $originZ);

// ************************************************************************* //
